resources/use_cases/incompressible_icoFoam_cavity_cavity/Allrun
#!/bin/sh
cd "${0%/*}" || exit 1    # Run from this directory

# Source OpenFOAM run functions
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

echo "Running blockMesh in $(pwd)"
runApplication blockMesh

echo "Running solver in $(pwd)"
runApplication $(getApplication)

echo "Converting to VTK"
runApplication foamToVTK

# Optionally, display the first few lines of log files:
echo "===== Displaying first 50 lines of logs ====="
find . -type f -name "log*" | while read -r log; do
    echo "---- $log ----"
    head -n 50 "$log"
    echo "--------------------------------------"
done
